import { Typography } from "@mui/material";
import Link from "next/link";
import React from "react";
import { useTranslation } from "next-i18next";

interface Props {
	children: React.ReactNode;
}
const TypographyStyle = ({ children }: Props) => {
	return (
		<>
			<>{children}</>
		</>
	);
};
const TypographyUnderLine = ({ children }: Props) => {
	return (
		<>
			<Typography
				component={"span"}
				sx={{
					fontSize: { xs: "19px", md: "24px" },
					fontWeight: "800",
					lineHeight: "25px",
					marginX: "1rem",
					// textAlign: "justify",
					textDecoration: "underline",
				}}
			>
				{children}
			</Typography>
		</>
	);
};

const ContentArabic = () => {
	const { t } = useTranslation("terms");

	return (
		<ul className="list_one">
			<li className="">
				<b>أ.</b>
				<TypographyStyle>
					<TypographyUnderLine>الموقع الالكتروني</TypographyUnderLine>
					<Link
						href="https://viewonwebsite.com"
						style={{
							color: "inherit",
							marginLeft: "1rem",
							marginRight: "1rem",
						}}
					>
						[viewonwebsite.com]
					</Link>
					('موقع الويب' او 'الموقع') عبارة عن منصة عبر الإنترنت، والغرض الرئيسي
					منها هو تقديم خدمة
					<b>'الخدمة'</b>
					للمستخدمين مقابل دفع مبلغ اشتراك، والذي يمكن أن يكون شهريًا أو نصف
					سنويًا أو سنويًا ، أو دفعة لمرة واحدة مقابل الخدمة المميزة لموقع الويب
					(“ <b>الخدمة المميزة</b>”) ('يشار إليها معًا باسم الخدمات
					<b>'الخدمة'</b>')
				</TypographyStyle>
			</li>
			<li className="">
				<b>ب.</b>
				<TypographyStyle>
					<TypographyUnderLine> أطراف التعاقد/ للشروط </TypographyUnderLine>
					'نحن؛''لنا'؛انفسنا'؛ أو أي مرجع مشابه يشير إلى View On Website Portal
					Co. LLC ، المرخصة من قبل Dubai Economy and Tourism ، والتي تحمل رقم
					الترخيص 1130382 ولها مكاتب في دبي ، الإمارات العربية المتحدة
					('الإمارات العربية المتحدة') (“UAE”). نحن نمتلك الموقع ونديره. مصطلحات
					أنت' ؛ 'لك'؛ 'انك' 'مستخدم'؛'المستخدمون' ؛ أو أي مرجع مشابه يشير إليك
					كمستخدم للموقع
				</TypographyStyle>
			</li>
			<li className="">
				<b>ت.</b>
				<TypographyStyle>
					<TypographyUnderLine>قبول الشروط والأحكام </TypographyUnderLine>
					تحكم هذه الشروط والأحكام (“الشروط”) استخدامك وتصفحك لهذا الموقع. من
					خلال الوصول والدخول إلى هذا الموقع أو استخدامه، فإنك توافق على الإقرار
					والامتثال لهذه الشروط. إذا كنت لا توافق على أي جزء من هذه الشروط،
					فيرجى الامتناع عن استخدام هذا الموقع.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ث.</b>
				<TypographyStyle>
					<TypographyUnderLine>تعديل الشروط. </TypographyUnderLine>
					نحتفظ بالحق في تعديل، أو تعليق أو تغيير الموقع أو هذه الشروط أو أي جزء
					منها في أي وقت دون إشعار. قد نقوم بمراجعة او تغير هذه الشروط عن طريق
					تحديث هذه الصفحة. من خلال وفي حال الاستمرار في استخدام هذا الموقع بعد
					أي تغييرات، فإنك توافق على الالتزام بالشروط المعدلة
				</TypographyStyle>
			</li>
			<li className="">
				<b>ج.</b>
				<TypographyStyle>
					<TypographyUnderLine>إقراراتك وضماناتك. </TypographyUnderLine>
					عندما تستخدم هذا الموقع و / أو تنشئ حسابًا، فإنك تقدم لنا الإقرارات
					والضمانات التالية:
				</TypographyStyle>
				<ol className="list_two">
					<li className="">
						<TypographyStyle>
							لا يقل عمرك عن 18 عامًا، ويُسمح لك قانونًا بمشاهدة وتصفح موقع
							الويب وإجراء المعاملات عبر الموقع (إذا كان ذلك مطلوبًا) ، وتلبية
							تفاصيل معايير الأهلية الخاصة بنا في الشروط
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أنك قدمت معلومات صحيحة و واضحة ودقيقة في وقت تسجيلك على الموقع
						</TypographyStyle>
					</li>

					<li>
						<TypographyStyle>
							أنت توافق على استخدام معلومات التسجيل الخاصة بك لشراء خدماتنا، على
							النحو المفصل في مكان آخر في الشروط
						</TypographyStyle>
					</li>

					<li>
						<TypographyStyle>
							أنك ستستخدم موقع الويب هذا للاستخدام المقصود فقط ووفقًا للشروط
						</TypographyStyle>
					</li>

					<li>
						<TypographyStyle>
							بأن اسم المستخدم وكلمة المرور الخاصين بك على الموقع الإلكتروني
							سيكون مسؤوليتك وحدك، وأنك ستقوم بإخطارنا على الفور إذا فقدت اسم
							المستخدم وكلمة المرور لحساب المستخدم الخاص بك أو تم اختراقها بأي
							شكل من الأشكال
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							لا تقصد ولن تحاول التخريب، او خرق أو التدخل أو التصرف بأي طريقة من
							الطرق التي قد تتعارض مع الشروط أو قوانين دولة الإمارات العربية
							المتحدة
						</TypographyStyle>
					</li>
				</ol>
			</li>
			<br />-{" "}
			<TypographyStyle>
				تقع على عاتقك مسؤولية التأكد من فهمك لجميع جوانب الخدمات التي تشترك فيها
				قبل الاشتراك. بمجرد اكتمال الاشتراك من خلال موقع الويب، يجب أن تكون أي
				عمليات إلغاء وفقًا لسياسة الإلغاء الواردة في هذه الشروط. يكتمل الاشتراك
				بمجرد إرسال تفاصيل الدفع الخاصة بك وان تتلقى مدفوعاتك ونستلمها بشكل
				صحيح، بغض النظر عما إذا كنت قد تلقيت الاشتراك أو تستخدمه أو تريده لاحقًا
				أم لا. أنت وحدك المسؤول عن أي إفصاح عن المعلومات التي تنشئها أو تبدأها
				او توفرها فيما يتعلق بالخدمات ؛ ودقة معلومات الحساب التي تقدمها ونوع
				الاشتراك الذي تحدده عبر موقع الويب هي مسؤوليتك وحدك.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				نحن لا نقدم أي ضمانات أو إقرارات بشأن جودة الخدمات أو حسن توقيتها أو
				سلامتها أو تقديمها ، وأنت توافق على إعفائنا وتعويضنا من أي مشكلات أو
				مطالبات منك بشأن أي شيء يتعلق بالموقع الإلكتروني و / أو الخدمات.
			</TypographyStyle>
			<li className="">
				<b>ح.</b>
				<TypographyStyle>
					<TypographyUnderLine>شروط الدفع والفواتير </TypographyUnderLine>
					نقدم خيارات دفع الاشتراك التالية لخدماتنا:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>
							شهريًا: المدفوعات مستحقة على أساس شهري.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							نصف سنوي: المدفوعات مستحقة كل ستة أشهر
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>سنويا: المدفوعات مستحقة سنويا</TypographyStyle>
					</li>
				</ol>
			</li>
			<br />-{" "}
			<TypographyStyle>
				نقدم أيضًا خدمة Premium ('الخدمة المميزة') الخاصة بنا ، والتي تتضمن
				ميزات إضافية ، مقابل دفعة لمرة واحدة طوال عمر حسابك
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				ستتم معالجة جميع المدفوعات من خلال بوابة الدفع Stripe. يوافق المستخدم
				على الامتثال لشروط وأحكام Stripe ويقر بأن الموقع لا يخزن أو يحتفظ بأي
				معلومات متعلقة بالدفع. بغض النظر عن خيار الدفع المختار ، فإن الدفع مقابل
				اشتراكك و / أو الخدمة المميزة لمرة واحدة التي يقدمها الموقع الإلكتروني
				مستحقة الدفع في غضون سبعة (7) أيام من تاريخ إنشاء الحساب ، أو في غضون
				سبعة (7) أيام من تلقي إشعار الدفع ، أيهما سابق او قابل للتطبيق.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				قد يؤدي عدم إجراء الدفع خلال الإطار الزمني المحدد إلى تعليق أو إنهاء
				الحساب. في حالة عدم السداد أو فشل السداد ، نحتفظ بالحق في تعليق حسابك أو
				إنهائه ، وفقًا لتقديرنا الخاص. لن نكون مسؤولين عن أي خسارة أو ضرر ناتج
				عن تعليق أو إنهاء حسابك بسبب عدم الدفع.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				سنرسل إشعارات الفواتير إلى عنوان البريد الإلكتروني المسجل في حسابك. تقع
				على عاتقك مسؤولية التأكد من أن عنوان البريد الإلكتروني المقدم دقيق وحديث
				(محدث). أنت تقر بأن عدم تلقي أو قراءة إشعارات الفواتير لا يعفيك من
				الالتزام بسداد الدفعات في الوقت المناسب. المدفوعات المدفوعة مقابل
				الخدمات غير قابلة للاسترداد، باستثناء ما هو منصوص عليه صراحة في سياسة
				الاسترداد الخاصة بنا.
			</TypographyStyle>
			<li className="">
				<b>خ.</b>
				<TypographyStyle>
					<TypographyUnderLine>الرسوم والمبالغ المستردة. </TypographyUnderLine>
					الرسوم المدفوعة للخدمات المقدمة على هذا الموقع غير قابلة للاسترداد ،
					ما لم ينص صراحة على خلاف ذلك. يجب تقديم أي طلبات لاسترداد الأموال
					كتابيًا وسيتم النظر فيها وفقًا لتقديرنا الخاص. سيعتمد قرار منح استرداد
					، سواء جزئيًا أو كليًا ، على الظروف المحيطة بالطلب ولن يشكل سابقة
					للمعاملات المستقبلية.
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				في الحالات التي تتم فيها الموافقة على استرداد الأموال ، نحتفظ بالحق في
				خصم أي رسوم إدارية مطبقة أو رسوم معالجة أو تكاليف أخرى مرتبطة
				بالاسترداد. ستتم معالجة المبالغ المستردة ، في حالة الموافقة عليها ،
				باستخدام نفس طريقة الدفع المستخدمة للمعاملة الأصلية ، ما لم يتفق الطرفان
				على خلاف ذلك.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				في جميع الحالات ، الدفع مقابل الخدمة المميزة غير قابل للاسترداد.
			</TypographyStyle>
			<li className="">
				<b>د.</b>
				<TypographyStyle>
					<TypographyUnderLine> القيود على الاستخدام. </TypographyUnderLine>
					يُحظر تمامًا على المستخدمين استخدام هذا الموقع أو أي من الخدمات
					المرتبطة به في أي أنشطة غير قانونية أو غير أخلاقية أو تتعارض مع
					المصالح والسياسة العامة. من خلال الوصول إلى هذا الموقع أو استخدامه ،
					فإنك توافق على أنك لن تشارك في أي مما يلي:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>
							الأنشطة غير القانونية: أي استخدام للموقع ينتهك القوانين أو اللوائح
							أو القوانين المحلية أو الوطنية أو الدولية. وهذا يشمل على سبيل
							المثال لا الحصر أنشطة مثل القرصنة والوصول غير المصرح به إلى أنظمة
							الكمبيوتر وتوزيع البرامج الضارة أو المحتوى الضار وانتهاك حقوق
							الملكية الفكرية وأي إجراءات أخرى غير قانونية
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							السلوك غير الأخلاقي أو غير الأدبي: أي استخدام للموقع يتضمن
							الانخراط في أنشطة تعتبر غير أخلاقية أو غير كريمة أو مسيئة. وهذا
							يشمل ، على سبيل المثال لا الحصر ، أنشطة مثل المواد الصريحة
							والخادشة للحياء العام أو المضايقات أو خطاب الكراهية أو التمييز أو
							الترويج للعنف أو استغلال القاصرين أو أي سلوك آخر ينتهك المعايير
							الأخلاقية المقبولة عمومًا.
						</TypographyStyle>
					</li>

					<li>
						<TypographyStyle>
							انتهاك المصلحة العامة: أي استخدام للموقع يتعارض مع المصلحة العامة
							أو السلامة العامة أو رفاهية الآخرين. وهذا يشمل ، على سبيل المثال
							لا الحصر ، أنشطة مثل التحريض على العنف أو الإرهاب أو الترويج
							للمواد أو الأنشطة غير القانونية أو نشر معلومات كاذبة أو معلومات
							مضللة أو أي سلوك آخر يشكل تهديدًا لرفاهية الجمهور.
						</TypographyStyle>
					</li>
				</ol>
			</li>
			<br />-{" "}
			<TypographyStyle>
				نحن نحتفظ بالحق ، وفقًا لتقديرنا الخاص ، في التحقيق واتخاذ الإجراءات
				القانونية المناسبة ضد أي مستخدم يشارك في أنشطة محظورة. قد يؤدي انتهاك
				هذا البند والفقرة (ج) إلى إنهاء حسابك و / أو منعك من الوصول إلى موقع
				الويب واستخدامه، وقد يشمل أيضًا الإبلاغ عن مثل هذه الأنشطة إلى سلطات
				إنفاذ القانون ذات الصلة.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				باستخدام هذا الموقع ، فإنك تقر وتوافق على أنك المسؤول الوحيد عن أي عواقب
				تنشأ عن استخدامك للموقع وأنك ستمتثل لجميع القوانين واللوائح المعمول بها
				أثناء استخدام الموقع والخدمات.
			</TypographyStyle>
			<li className="">
				<b>ذ.</b>
				<TypographyStyle>
					<TypographyUnderLine>
						إلغاء وإنهاء الاشتراكات والحسابات.{" "}
					</TypographyUnderLine>
					جوز للمستخدمين إلغاء حساباتهم و / أو اشتراكاتهم على الموقع الإلكتروني
					في أي وقت باتباع عملية إلغاء الحساب المحددة ، والتي يمكن الوصول إليها
					من خلال إعدادات حساب المستخدم أو عن طريق الاتصال بدعم العملاء لدينا.
					عند الإلغاء ، سيتم إلغاء تنشيط وصول المستخدم إلى الخدمات المشتركة في
					موقع الويب على الفور ، وسيتم حذف جميع بيانات المستخدم والمعلومات
					المرتبطة بالحساب نهائيًا ، وفقًا لأي متطلبات قانونية أو تنظيمية سارية.
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				نحتفظ بالحق في إنهاء أو تعليق حساب المستخدم و / أو الاشتراك دون إشعار
				مسبق إذا كان هناك اعتقاد معقول بأن المستخدم قد انتهك أي بند من البنود أو
				شارك في أي أنشطة غير قانونية أو احتيالية أو غير مصرح بها على الموقع.
				يجوز لنا أيضًا إنهاء الحسابات غير النشطة التي لم تدفع مقابل الاشتراك في
				غضون سبعة أيام من تاريخ الإنشاء أو لم تظهر أي نشاط لفترة طويلة من الوقت
				، على النحو الذي نحدده وفقًا لتقديرنا الخاص. قبل الإنهاء ، سيتم بذل جهود
				معقولة لإعلام المستخدم عبر عنوان البريد الإلكتروني المرتبط بالحساب.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				عند إنهاء الحساب ، سيتم إلغاء وصول المستخدم إلى الموقع وخدماته على
				الفور. لن نكون مسؤولين تجاهك أو تجاه أي طرف ثالث عن أي إنهاء للوصول إلى
				الموقع. سيؤدي إنهاء الحساب إلى الحذف الدائم لجميع بيانات المستخدم
				والمعلومات المرتبطة بالحساب ، مع مراعاة أي متطلبات قانونية أو تنظيمية
				سارية.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				في حالة قيام المستخدم بإلغاء الحساب و / أو إلغاء الاشتراك أو إنهائه ، لن
				نقدم أي مبالغ مستردة أو أرصدة لفترات الاشتراك غير المستخدمة أو أي رصيد
				متبقي. لن يتم رد أي رسوم أو مصاريف تم تكبدها قبل الإنهاء.
			</TypographyStyle>
			<li className="">
				<b>ر.</b>
				<TypographyStyle>
					<TypographyUnderLine>الملكية الفكرية. </TypographyUnderLine>
					الموجود على هذا الموقع ، بما في ذلك النصوص والصور والرسومات والشعارات
					والمواد الأخرى ، محمي بموجب حقوق الملكية الفكرية ، بما في ذلك حقوق
					النشر والعلامات التجارية. محتوى الموقع بالكامل ، بما في ذلك على سبيل
					المثال لا الحصر المحتوى والتصميمات والرسومات والصور ومقاطع الفيديو
					والعروض التقديمية التفاعلية والشعارات ،والنصوص والترتيبات والمخططات هي
					ملكنا الوحيد والحصري أو مرخصة لنا وجميع الحقوق محفوظة. جميع العلامات
					التجارية والأسماء التجارية وجميع مشتقاتها الأخرى ، بما في ذلك العلامات
					التجارية التي تظهر على الموقع ، مملوكة لنا ولا يجوز استخدامها إلا من
					قبل المرخص لهم الذين نمنحهم أو نرخص لهم هذه الحقوق على وجه التحديد.
					أنت توافق على عدم استخدام أو نشر أو نقل او نسخ أو إجراء هندسة عكسية
					لأي محتوى أو ملكية فكرية أخرى للموقع ، أو مساعدة طرف ثالث على القيام
					بذلك ، دون موافقة كتابية مسبقة منا.
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				حقوق الملكية. من خلال الوصول إلى هذا الموقع واستخدامه ، فإنك تقر وتوافق
				على أن جميع حقوق الملكية ، بما في ذلك على سبيل المثال لا الحصر ، حقوق
				الملكية الفكرية ، في المحتوى والمواد وأي معلومات أخرى معروضة أو مقدمة
				على الموقع ، تخصنا وحدنا وحصريًا. نمنحك ترخيصًا محدودًا وغير حصري وغير
				قابل للتحويل للوصول إلى موقع الويب ومحتوياته واستخدامهما للأغراض
				المقصودة منه فقط ، وفقًا لهذه الشروط. لا يمنحك هذا الترخيص أي حقوق ملكية
				أو أي حقوق لتعديل أو إعادة إنتاج أو توزيع أو عرض أو نقل أو إنشاء أعمال
				مشتقة من الموقع أو محتواه ، دون موافقة خطية مسبقة منا.
			</TypographyStyle>
			<li className="list_li">
				<b>ز.</b>
				<TypographyStyle>
					<TypographyUnderLine>حدود المسؤولية</TypographyUnderLine>
					نحن نسعى جاهدين لتوفير معلومات دقيقة وحديثة على هذا الموقع. ومع ذلك ،
					فإننا لا نضمن اكتمال أو دقة أو موثوقية أي محتوى على هذا الموقع.
					استخدامك لهذا الموقع هو على مسؤوليتك الخاصة ، ولن نكون مسؤولين عن أي
					أضرار تنشأ عن استخدامك لهذا الموقع أو الاعتماد على أي معلومات مقدمة
					هنا. بالإضافة إلى ذلك ، تخضع صيانة, بقاء والحفاظ على الخدمة الممتازة
					والاشتراك في الموقع ، بما في ذلك مزيد من التطوير والاستمرار ، لتقديرنا
					الخاص ، ودون أي مسؤولية تجاه أي طرف ، بما في ذلك على سبيل المثال لا
					الحصر المستخدمين
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				لن تتجاوز مسؤوليتنا الجماعية والكاملة أو مسؤولية موظفينا أو الوكلاء
				القانونيين أو المديرين أو المديرين أو المساهمين أو مزودي الخدمة بأي حال
				من الأحوال مبلغ 1،000 درهم إماراتي في المجموع ، والذي يتضمن أي تعويض عن
				أتعاب المحاماة وتكاليفها. ينطبق تحديد المسؤولية هذا على أي إجراء ، بغض
				النظر عن الطرف أو الأطراف التي بدأته وما إذا كان شكل الإجراء في العقد أو
				المسؤولية التقصيرية أو غير ذلك ، وينطبق إلى أقصى حد ممكن بموجب قانون
				دولة الإمارات العربية المتحدة.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				في أي حالة أو إجراء بدأه أي طرف بموجب أي نظرية قانونية ، لن نتحمل نحن
				وموظفونا والوكلاء القانونيون والمديرون والمديرون والمساهمون و / أو مقدمو
				الخدمات أي مسؤولية عن الأضرار من أي نوع ، بما في ذلك على سبيل المثال لا
				الحصر ، الفعلية ، غير مباشر ، أو خاص ، أو عرضي ، أو تبعي ، أو عقابي ، أو
				خسارة الدخل ، أو الإيرادات ، أو الأرباح ؛ فقدان العمل الفعلي أو المتوقع
				، أو فقدان الشهرة أو البيانات أو الاستخدام ؛ والأضرار المرتبطة بالإصابة
				الشخصية ، والاضطراب العاطفي ، والألم والمعاناة ، والإضرار بالأخلاق أو
				السمعة ؛ سواء كان ذلك ناتجًا عن خرق العقد أو الضرر أو غير ذلك ، وبغض
				النظر عما إذا كان هذا الضرر أو الخسارة متوقعة أم لا.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				لا يؤثر ما ورد أعلاه على أي مسؤولية لا يمكن تقييدها أو استبعادها بموجب
				قانون دولة الإمارات العربية المتحدة.
			</TypographyStyle>
			<li className="">
				<b>س.</b>
				<TypographyStyle>
					<TypographyUnderLine>التجديدات التلقائية </TypographyUnderLine>
					بالاشتراك في موقعنا ، فإنك تقر وتوافق على أنه سيتم تجديد اشتراكك
					تلقائيًا لفترات اشتراك لاحقة ما لم تقم بإلغاء الاشتراك أو إنهائه قبل
					تاريخ التجديد. أنت تصرح لنا بتحصيل رسوم التجديد من طريقة الدفع التي
					اخترتها.
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				سنزودك بإشعار بالتجديد القادم قبل سبعة (7) أيام على الأقل من تاريخ
				التجديد التلقائي. سيتم إرسال الإشعار إلى عنوان البريد الإلكتروني المرتبط
				بحسابك أو من خلال وسائل الاتصال الأخرى المتاحة على منصتنا.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				إذا كنت ترغب في إلغاء اشتراكك وتجنب التجديد التلقائي ، فيجب عليك القيام
				بذلك خلال فترة الإلغاء المحددة ، والتي تكون عادةً قبل 30 يومًا من تاريخ
				التجديد. سيؤدي عدم إلغاء اشتراكك خلال هذه الفترة إلى التجديد التلقائي
				لاشتراكك وسيتم تطبيق الرسوم المقابلة.
			</TypographyStyle>
			<li className="">
				<b>ش.</b>
				<TypographyStyle>
					<TypographyUnderLine>حقوق الطرف الثالث </TypographyUnderLine>
					الخدمات المقدمة على هذا الموقع مخصصة فقط لفائدة المستخدمين ومالك
					الموقع ، ولن يكون لأي طرف ثالث أي حقوق أو مزايا بموجب هذه الشروط. ما
					لم يتم النص صراحةً في هذه الشروط ، لا يُقصد بأي شرط من هذه الاتفاقية
					منح أي حقوق أو تعويضات لأي شخص أو كيان بخلاف المستخدم ومالك موقع الويب
				</TypographyStyle>
			</li>
			<br />-{" "}
			<TypographyStyle>
				لا يُعتبر أي طرف ثالث ، بما في ذلك على سبيل المثال لا الحصر الشركات
				التابعة أو الشركاء أو البائعين ، طرفًا في هذه الاتفاقية ولن يكون له أي
				حقوق لفرض أي شرط من هذه الشروط أو الاعتماد عليه. يوافق المستخدم على أنه
				لن يكون لأي طرف ثالث أي صفة لتأكيد دعوى أو اتخاذ إجراء قانوني مباشرة ضد
				مالك الموقع ، وأي محاولة للقيام بذلك تعتبر لاغية وباطلة.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				يمتد تقييد حقوق الطرف الثالث المنصوص عليه في هذا البند ليشمل أي خلفاء أو
				متنازل لهم أو ممثلين أو وكلاء لمالك الموقع. لا يجوز لأي طرف ثالث الحصول
				على أي حقوق أو مزايا أو مصالح بحكم او بموجب علاقته بالمستخدم أو أي تفاعل
				مع الموقع.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				من خلال الوصول او التصفح إلى هذا الموقع أو استخدامه، يقر المستخدم ويوافق
				على أن أي حقوق أو التزامات ناشئة عن هذه الشروط هي فقط بين المستخدم ومالك
				الموقع ، مع استبعاد أي طرف ثالث.
			</TypographyStyle>
			<li className="">
				<b>ص.</b>
				<TypographyStyle>
					<TypographyUnderLine>سرية معلومات المستخدم </TypographyUnderLine>
					نحن نتفهم أهمية الخصوصية وسرية معلوماتك الشخصية. يوضح هذا البند
					التزامنا بحماية معلوماتك مع الامتثال أيضًا للقوانين والمتطلبات
					القانونية المعمول بها.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					عند استخدامك لموقعنا الإلكتروني ، قد يُطلب منك تقديم معلومات شخصية
					معينة. نحن نجمع هذه المعلومات ونستخدمها فقط لغرض توفير خدماتنا
					وتحسينها ، كما هو موضح في سياسة الخصوصية الخاصة بنا. نحن ملتزمون
					بالحفاظ على سرية المعلومات التي تزودنا بها. باستثناء ما هو منصوص عليه
					في هذه الفقرة أو ما يقتضيه القانون ، لن نكشف عن معلوماتك الشخصية أو
					نشاركها أو نبيعها أو نؤجرها إلى أي طرف ثالث دون موافقتك الصريحة.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					قد نكشف عن معلوماتك الشخصية في الحالات التالية:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>
							الالتزام القانوني: قد نشارك معلوماتك إذا اعتقدنا بحسن نية أن هذا
							الكشف ضروري للامتثال لأي قوانين أو لوائح أو إجراءات قانونية أو
							طلبات حكومية معمول بها. وهذا يشمل التعاون مع وكالات إنفاذ القانون
							أو الإجراءات القضائية أو أوامر المحكمة.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							حماية الحقوق: قد نكشف عن معلوماتك لحماية حقوقنا أو سلامتنا أو
							ممتلكاتنا ، بالإضافة إلى حقوق مستخدمينا أو موظفينا أو عامة الناس
							أو سلامتهم أو ممتلكاتهم.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							الاندماج أو الاستحواذ: في حالة الاندماج أو الاستحواذ أو البيع
							لجميع أصولنا أو جزء منها ، قد يتم نقل معلوماتك الشخصية كجزء من
							الصفقة. سوف نتأكد من أن الطرف المستلم يحافظ على نفس مستوى السرية
							كما هو موضح في هذه الشروط والأحكام.
						</TypographyStyle>
					</li>
				</ol>
				<br />-{" "}
				<TypographyStyle>
					قد نقوم أيضًا بجمع واستخدام ومشاركة البيانات المجمعة والمجهولة المصدر
					لأغراض مختلفة ، بما في ذلك على سبيل المثال لا الحصر التحليلات والبحث
					والتسويق. هذه البيانات لن تحدد هويتك بشكل شخصي. بالإضافة إلى ذلك ، قد
					يحتوي موقعنا على روابط أو عمليات تكامل مع خدمات أو مواقع ويب تابعة
					لجهات خارجية. ينطبق هذا البند فقط على المعلومات التي يتم جمعها على
					موقعنا ، ونحن لسنا مسؤولين عن ممارسات الخصوصية أو محتوى أي خدمات تابعة
					لجهات خارجية. بينما نتخذ تدابير معقولة لحماية معلوماتك ، من المهم
					بالنسبة لك أن تفهم أنه لا يمكن ضمان أمان نقل البيانات عبر الإنترنت أو
					طريقة التخزين بنسبة 100٪. باستخدام موقعنا ، فإنك تقر وتقبل هذه المخاطر
					الكامنة.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ض.</b>
				<TypographyStyle>
					<TypographyUnderLine>الأهلية.</TypographyUnderLine>
					من خلال الوصول إلى هذا الموقع أو استخدامه ، فإنك تقر وتتعهد بأن عمرك
					لا يقل عن 18 عامًا. إذا كنت تقوم بالوصول إلى موقع الويب او تصفحه أو
					استخدامه نيابة عن شركة أو مؤسسة أو كيان قانوني آخر ، فإنك تقر وتضمن أن
					لديك السلطة لإلزام هذا الكيان بهذه الشروط. يجوز لنا ، وفقًا لتقديرنا
					الخاص ، طلب معلومات أو وثائق إضافية للتحقق من أهليتك كشركة تحمل
					ترخيصًا تجاريًا صالحًا. قد يؤدي عدم تقديم مثل هذه المعلومات أو الوثائق
					إلى تعليق أو إنهاء حسابك
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					إذا كنت لا تفي بشرط الأهلية هذا ، فيجب عليك الامتناع عن الوصول إلى
					الموقع أو استخدامه. نحتفظ بالحق في رفض الوصول إلى أو إنهاء حسابات
					الأفراد أو الكيانات التي لا تفي بمتطلبات الأهلية أو تنتهك أي شرط من
					هذه الشروط ، دون إشعار مسبق أو مسؤولية.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ط.</b>
				<TypographyStyle>
					<TypographyUnderLine>
						استخدام الموقع للأغراض المقصودة.{" "}
					</TypographyUnderLine>
					من خلال الوصول إلى هذا الموقع واستخدامه ، فإنك توافق على الالتزام
					بالشروط. من المهم ملاحظة أن موقع الويب مخصص لأغراض محددة ، وأن
					استخدامك للموقع يدل على تفهمك وموافقتك على استخدامه للأغراض المقصودة
					والمعنية فقط. أي استخدام للموقع ينحرف عن الأغراض المقصودة قد يؤدي إلى
					إنهاء أو تعليق وصولك إلى الموقع او استخدامه ، وفقًا لتقديرنا الخاص.
					أنت مسؤول عن التأكد من أن استخدامك للموقع يتوافق مع هذه الشروط.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					أنت توافق على استخدام الموقع للأغراض المشروعة فقط وبطريقة لا تنتهك أو
					تقيد حقوق الآخرين ، أو تمنع تمتعهم بالموقع. أنت تقر بأنك لن تستخدم
					الموقع للانخراط في أي نشاط ضار أو مسيء أو غير قانوني أو ينتهك أي
					قوانين أو لوائح معمول بها.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					أنت توافق على عدم استخدام موقع الويب بأي طريقة قد تضر بوظائف الموقع أو
					تعطلها أو تثقل كاهلها أو تضعفها أو تتداخل مع استخدام أي طرف آخر
					للموقع. أنت توافق أيضًا على عدم الانخراط في أي نشاط قد يضر بأمن أو
					سلامة أو توفر موقع الويب أو الأنظمة المرتبطة به
				</TypographyStyle>
			</li>
			<li className="">
				<b>ظ.</b>
				<TypographyStyle>
					<TypographyUnderLine>
						كتابة مراجعة أو ترك ملاحظات{" "}
					</TypographyUnderLine>
					من خلال تقديم مراجعة, تقيم أو تقديم تعليقات ('محتوى المستخدم') على هذا
					الموقع ، فإنك توافق على ما يلي:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>
							أنت تقر بأن أي محتوى المستخدم الذي ترسله يبقى مسؤوليتك وحدك. ومع
							ذلك، من خلال تقديم محتوى المستخدم ، فإنك تمنح موقع الويب والشركات
							التابعة له ترخيصًا عالميًا وخاليًا من حقوق الملكية ودائمًا وغير
							قابل للإلغاء وغير حصري وقابل للتحويل لاستخدام وإعادة إنتاج وتعديل
							وتكييف ونشر وترجمة وتوزيع وعرض وأداء محتوى المستخدم هذا في أي
							وسائط معروفة الآن أو يتم تطويرها فيما بعد ، لأي غرض كان.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أنت تقر وتتعهد بأن أي محتوى المستخدم الذي ترسله صادق ودقيق على حد
							علمك. أنت توافق على عدم تقديم أي معلومات خاطئة أو مضللة أو خادعة.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أنت توافق على الامتثال لجميع القوانين واللوائح والإرشادات المعمول
							بها أثناء إرسال محتوى المستخدم. لا يجوز لك نشر أي محتوى تشهيري، أو
							مخالف، أو فاحش أو مضايق أو غير مرغوب فيه بأي شكل من الأشكال.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							يحتفظ موقع الويب بالحق، ولكن ليس الالتزام ، بمراجعة ومراقبة وإزالة
							أي محتوى مستخدم ينتهك هذه الشروط ، دون إشعار مسبق. يجوز لنا ممارسة
							هذا الحق وفقًا لتقديرنا الخاص.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أنت تدرك وتوافق على أنك المسؤول الوحيد عن أي محتوى مستخدم ترسله.
							أنت تتحمل جميع المخاطر المرتبطة باستخدام محتوى المستخدم الخاص بك،
							بما في ذلك أي اعتماد على دقته أو اكتماله أو فائدته.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أنت توافق على تعويض الموقع الإلكتروني وأصحابه والشركات التابعة له
							والموظفين والوكلاء وإبعاد الضرر عنهم من أي مطالبات أو أضرار أو
							مسؤوليات أو تكاليف أو نفقات تنشأ عن أو تتعلق بمحتوى المستخدم الخاص
							بك ، بما في ذلك على سبيل المثال لا الحصر أي مطالبات من قبل أطراف
							ثالثة.
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							سنتعامل مع معلوماتك الشخصية وفقًا لسياسة الخصوصية الخاصة بنا. من
							خلال تقديم محتوى المستخدم ، فإنك توافق على جمع معلوماتك الشخصية
							واستخدامها والكشف عنها كما هو موضح في سياسة الخصوصية الخاصة بنا
						</TypographyStyle>
					</li>
				</ol>
			</li>
			<li className="">
				<b>ع.</b>
				<TypographyStyle>
					<TypographyUnderLine>الخصوصية </TypographyUnderLine>
					نحن ملتزمون بحماية خصوصيتك والامتثال لقوانين حماية البيانات المعمول
					بها ، بما في ذلك لائحة حماية البيانات العامة للاتحاد الأوروبي
					('GDPR'). تحدد سياسة الخصوصية الخاصة بنا كيفية جمع بياناتك الشخصية
					واستخدامها وتخزينها وحمايتها. باستخدام هذا الموقع ، فإنك توافق على
					معالجة بياناتك الشخصية كما هو موضح في سياسة الخصوصية الخاصة بنا.
				</TypographyStyle>
			</li>
			<li className="list_li">
				<b>غ.</b>
				<TypographyStyle>
					<TypographyUnderLine>روابط لمواقع الطرف الثالث </TypographyUnderLine>
					قد يتضمن الموقع روابط لمواقع طرف ثالث ('مواقع خارجية'). بمجرد النقر
					فوق هذه المواقع الخارجية أو الوصول إليها، ستغادر الموقع. نحن لا نتحرى
					أو نراجع أو نصادق أو نمثل أو نتغاضى عن أو نتحكم في محتوى أي من المواقع
					الخارجية، ما لم ينص على خلاف ذلك صراحة في الشروط. لن نكون مسؤولين، أو
					محاسبين او مرتبطين او معنيين عن المحتوى المعروض على المواقع الخارجية،
					وسوف تدخل إلى هذه المواقع الخارجية على مسؤوليتك وحدك. أنت توافق أيضًا
					على عدم ربط أي مواقع خارجية بالموقع الإلكتروني دون موافقتنا وموافقتنا
					الكتابية المسبقة الصريحة، ما لم وإلى الحد الذي يقع فيه ذلك ضمن نطاق
					خدماتنا المقدمة. قد ترسل المواقع الخارجية ملفات تعريف الارتباط الخاصة
					بها إليك أو تجمع البيانات أو تطلب معلومات شخصية بطريقة أخرى ، وأنت
					مسؤول عن التحقق من المواقع الخارجية لتحديد ومراجعة الشروط والأحكام
					وسياسة الخصوصية الخاصة بها. أنت تقر بموجب هذا بأنك تقوم بالوصول إلى
					المواقع الخارجية و / أو تصفحها و / أو ربطها و / أو وضع إشارة مرجعية
					عليها على مسؤوليتك الخاصة.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					قد تشاهد إعلانات على موقع الويب يتم تحديدها وتسليمها بواسطة جهات
					خارجية، مثل شبكات الإعلانات ووكالات الإعلان والمعلنين وموفري شرائح
					الجمهور. قد تجمع هذه الجهات الخارجية معلومات عنك وعن أنشطتك عبر
					الإنترنت، إما على موقع الويب أو على مواقع الويب الأخرى، من خلال ملفات
					تعريف الارتباط وإشارات الويب وغيرها من التقنيات في محاولة لفهم
					اهتماماتك وتقديم إعلانات مخصصة لك حسب اهتماماتك. ليس لدينا إمكانية
					الوصول إلى المعلومات التي قد تجمعها هذه الأطراف الثالثة أو التحكم
					فيها، ونحن لسنا مسؤولين عن ممارساتهم. لا يتم تغطية ممارسات المعلومات
					الخاصة بهذه الأطراف الثالثة في هذه الشروط ولا في سياسة الخصوصية الخاصة
					بنا. تقع على عاتقك مسؤولية مراجعة الشروط والأحكام وسياسات الخصوصية
					لهذه الأطراف الثالثة، ونحن لسنا مسؤولين عن أفعال أو إغفالات أي طرف
					ثالث.
				</TypographyStyle>
			</li>
			<li className="list_li">
				<b>ف.</b>
				<TypographyStyle>
					<TypographyUnderLine>
						مسؤول المظالم / الممثل المعين{" "}
					</TypographyUnderLine>
					نحن ندرك أهمية معالجة شكاوى المستخدمين ومخاوفهم في الوقت المناسب
					وبطريقة فعالة. لذلك ، قمنا بتعيين مسؤول شكاوى / ممثل معين ('الممثل
					المعين') للتعامل مع شكاوى المستخدمين المتعلقة بالخدمات المقدمة من خلال
					هذا الموقع.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					يجب أن يعمل الممثل المعين كنقطة اتصال مستقلة ومحايدة للمستخدمين الذين
					يرغبون في رفع شكاوى أو مطالبات أو مخاوف بشأن الموقع الإلكتروني أو
					خدماته. يجب على الممثل المعين ضمان معالجة جميع المظالم وحلها بشكل
					مناسب وفقًا للقوانين واللوائح المعمول بها.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					يمكن للمستخدمين الاتصال بالممثل المعين من خلال القنوات التالية:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>اسم الممثل المعين: TBA</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>المنصب / العنوان :TBA</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							{" "}
							تفاصيل الاتصال: support@viewonwebsite.com
						</TypographyStyle>
					</li>
				</ol>
				<TypographyStyle>
					يجب على المستخدمين تقديم المعلومات التالية عند تقديم شكوى إلى الممثل
					المعين:
				</TypographyStyle>
				<ol className="list_two">
					<li>
						<TypographyStyle>
							الاسم الكامل وبيانات الاتصال الخاصة بالمستخدم
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							وصف التظلم، بما في ذلك التفاصيل ذات الصلة والوثائق الداعمة ، إن
							وجدت
						</TypographyStyle>
					</li>
					<li>
						<TypographyStyle>
							أي معلومات أخرى قد يطلبها الممثل المعين بشكل معقول للتحقيق في
							التظلم ومعالجته بشكل فعال
						</TypographyStyle>
					</li>
				</ol>
				-{" "}
				<TypographyStyle>
					سنضمن أن الممثل المعين يحافظ على السرية التامة لجميع شكاوى المستخدم
					والمعلومات التي تم الكشف عنها أثناء عمليات معالجة المظالم والطعن،
					باستثناء ما يقتضيه القانون أو ضروريًا لحل التظلم.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					سنسعى لحل شكاوى المستخدمين في غضون إطار زمني معقول. نحن لا نضمن حل
					جميع المظالم ، لا سيما تلك الخارجة عن سيطرتنا أو ولايتنا القضائية. في
					حالة عدم رضاك عن القرار المقدم من الممثل المعين ، يمكنك تصعيد التظلم
					من خلال عملية الاستئناف الخاصة بنا ، ومن ثم من خلال القنوات القانونية
					المناسبة على النحو المبين في الشروط.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					يوافق المستخدمون على التعاون وتقديم معلومات دقيقة إلى الممثل المعين
					أثناء معالجة المظالم و / أو الاستئناف. لا يجوز للمستخدمين تقديم
					معلومات خاطئة أو مضللة أو خبيثة بقصد الإضرار.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					يقتصر دور الممثل المعين على معالجة المظالم والمخاوف التي أثارها
					المستخدمون فيما يتعلق بالموقع وخدماته. لا يتحمل الممثل المعين
					المسؤولية عن أي نزاعات أو مسائل قانونية تنشأ بين المستخدمين أو بين
					المستخدمين والأطراف الثالثة. باستخدام هذا الموقع ، يقر المستخدمون
					ويوافقون على تعيين الممثل المعين وعمليات معالجة المظالم والاستئناف.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ق.</b>
				<TypographyStyle>
					<TypographyUnderLine>التعويض. </TypographyUnderLine>
					أنت توافق على إبقائنا وموظفينا ومديرينا ومديرينا ووكلائنا القانونيين
					والمشرفين من غير ضرر والدفاع عن وتعويضهم من وضد أي مطالبة أو إجراء أو
					مسؤولية أو ضرر أو خسارة أو حكم أو جائزة أو تكلفة أو مصاريف أو اتعاب و
					تكاليف محامٍ معقولة. ومن الرسوم التي تنشأ عن أو تتعلق بأي انتهاك لهذه
					الشروط من قبلك أو من قبل وكيلك القانوني.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ك.</b>
				<TypographyStyle>
					<TypographyUnderLine>شرط القوة القاهرة </TypographyUnderLine>
					شرط القوة القاهرة في حالة منعنا من أداء أي من التزاماتنا بموجب هذه
					الشروط بسبب حدث خارج عن سيطرتنا المعقولة ، بما في ذلك على سبيل المثال
					لا الحصر ، أعمال الله ، والحرب ، والإرهاب ، وأعمال الشغب ، والإضرابات
					، والإغلاق ، والكوارث الطبيعية ، والإجراءات الحكومية ، أو أي حدث آخر
					غير متوقع ولا يمكن تجنبه ('حدث القوة القاهرة') ، عندئذٍ سيتم إعفاؤنا
					من أداء هذه الالتزامات طوال مدة حدث القوة القاهرة.- سنقوم بإخطارك على
					الفور بطريقة معقولة ، مع توفير تفاصيل عن حدث القوة القاهرة ومدته
					المتوقعة. سنبذل كل الجهود المعقولة للتخفيف من آثار حدث القوة القاهرة
					واستئناف أداء التزاماتنا في أقرب وقت ممكن عمليًا.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					سنقوم بإخطارك على الفور بطريقة معقولة ، مع توفير تفاصيل عن حدث القوة
					القاهرة ومدته المتوقعة. سنبذل كل الجهود المعقولة للتخفيف من آثار حدث
					القوة القاهرة واستئناف أداء التزاماتنا في أقرب وقت ممكن عمليًا.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					خلال فترة حدث القوة القاهرة ، سيتم تعليق التزاماتنا إلى الحد الذي
					تتأثر فيه بحدث القوة القاهرة. لن نكون مسؤولين عن أي أضرار أو عقوبات أو
					خسائر تتكبدها نتيجة عدم الأداء أو التأخير الناجم عن حدث القوة القاهرة.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					إذا استمر حدث القوة القاهرة لمدة 30 يومًا أو أكثر ، فيجوز لنا إنهاء
					هذه الشروط من خلال تقديم إشعار كتابي للمستخدمين. في مثل هذه الحالة ،
					لن نكون مسؤولين تجاهك عن أي أضرار أو عقوبات أو خسائر ناجمة عن الإنهاء
					بسبب حدث القوة القاهرة.
				</TypographyStyle>
				<br />-{" "}
				<TypographyStyle>
					لا يعفيك حدث القوة القاهرة من الالتزام بسداد أي مدفوعات أصبحت بالفعل
					مستحقة وواجبة السداد قبل وقوع حدث القوة القاهرة، ما لم يتم الاتفاق على
					خلاف ذلك كتابيًا بيننا وبينك.
				</TypographyStyle>{" "}
				<br /> -
				<TypographyStyle>
					باستخدام هذا الموقع ، فإنك تقر وتوافق على أن أداء الالتزامات بموجب هذه
					الشروط من قبلنا قد يتأخر أو يُمنع بسبب ظروف خارجة عن سيطرتنا ، وأنت
					تتنازل صراحةً عن أي مطالبة أو حق في طلب تعويضات أو تعويضات أخرى ضدنا
					تنشأ عن هذا التأخير. أو الوقاية.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ل.</b>
				<TypographyStyle>
					<TypographyUnderLine>التنازل والاستقلالية. </TypographyUnderLine>
					يشكل أي تنازل من جانبنا عن أي شرط أو بند منصوص عليه في هذه الشروط
					تنازلاً مستمراً عن هذا الشرط أو البند ، ولا يشكل أي إخفاق من جانبنا في
					تأكيد مطالبة أو حق بموجب أي حكم من أحكام هذه الشروط تنازلاً عن نفس
					المطالبة أو الحق. إذا وجدت أي محكمة أن أي جزء من الشروط غير قابل
					للتنفيذ أو غير صالح أو غير قانوني لأي سبب من الأسباب ، فسيتم اعتبار
					هذا الجزء محذوفًا وستظل بقية الشروط سارية المفعول والتأثير إلى أقصى حد
					تسمح به القوانين المعمول بها بالإمارات
				</TypographyStyle>
			</li>
			<li className="">
				<b>م.</b>
				<TypographyStyle>
					<TypographyUnderLine>كامل الاتفاقية/ التعاقد </TypographyUnderLine>
					تشكل الشروط وسياسة الخصوصية الخاصة بنا الاتفاقية الكاملة بيننا وبينك
					فيما يتعلق بالموقع الإلكتروني وتحل محل أي و جميع الاتفاقيات السابقة،
					سواء كانت شفهية أو مكتوبة.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ن.</b>
				<TypographyStyle>
					<TypographyUnderLine>
						{" "}
						القانون الحاكم والاختصاص القضائي{" "}
					</TypographyUnderLine>
					تخضع هذه الشروط لقوانين دولة الإمارات العربية المتحدة، بغض النظر عن أي
					تعارض في مبادئ القوانين. يجب على أي نزاع بيننا وبينك يتم التعامل معها
					أولاً من خلال عمليات التظلم والاستئناف الخاصة بنا. فقط بعد استنفاد هذه
					الخيارات، يُحال أي نزاع ينشأ عن هذه الشروط أو فيما يتعلق بها ، بما في
					ذلك أي سؤال يتعلق بوجودها أو صلاحيتها أو إنهائها ، إلى مركز دبي
					للتحكيم الدولي ويتم حله نهائيًا عن طريق التحكيم بموجب قواعد التحكيم
					المعمول بها في مركز دبي للتحكيم الدولي. تاريخ تقديم طلب التحكيم
					('القواعد') ، والتي تعتبر القواعد مدمجة بالإشارة إلى هذا البند. يجب أن
					يكون عدد المحكمين ، الذي يتم تعيينهم وفقًا للقواعد ، ثلاثة. يجب أن
					يكون المقر القانوني للتحكيم دبي ، الإمارات العربية المتحدة ، وتكون لغة
					التحكيم هي اللغة الإنجليزية.
				</TypographyStyle>
			</li>
			<li className="">
				<b>ه</b>
				<TypographyStyle>
					<TypographyUnderLine>الإخطارات وإخلاء المسؤولية </TypographyUnderLine>
					تستخدم الموقع على مسؤوليتك الخاصة. نحن لا نقدم أي ضمانات أو إقرارات ،
					سواء كانت صريحة أو ضمنية ، ناشئة عن القانون أو غير ذلك فيما يتعلق بدقة
					المحتوى على الموقع الإلكتروني أو جودة الخدمات ، ولا نتحمل أي مسؤولية
					أو مسؤولية عن أي أخطاء أو سهو. في محتوى الموقع أو فيما يتعلق بأي مشكلة
					أخرى تتعلق بهذه السلع أو الخدمات أو الأنشطة. يجوز لنا إجراء تغييرات
					على المحتوى أو المواد الموجودة في الموقع دون أي إشعار مسبق. نحن لسنا
					ملزمين بتحديث أي محتوى أو مادة على الموقع.
				</TypographyStyle>
			</li>
			-{" "}
			<TypographyStyle>
				نحتفظ بالحق في جميع الأوقات في الكشف عن أي معلومات قد تزودنا بها من خلال
				الموقع الإلكتروني لممثلينا القانونيين ومستشارينا وأي سلطة حكومية أو
				اتحادية في الإمارات العربية المتحدة دون أي إشعار مسبق أو شرط موافقة
				مسبقة.
			</TypographyStyle>
			<br />-{" "}
			<TypographyStyle>
				لن نتحمل المسؤولية أو المساءلة تجاهك أو تجاه أي طرف ثالث يعتمد عليك وأنت
				توافق على تعويضنا بالكامل عن أي خسارة أو إصابة أو مطالبة أو ضرر سواء
				كانت تكاليف أو مسؤوليات أو نفقات أو أضرار مباشرة أو غير مباشرة أو تبعية
				أو عقابية أو غير ذلك. التي قد تتعرض لها من خلال استخدام هذا الموقع أو
				شراء المنتج (المنتجات). لن نكون مسؤولين عن أي فيروسات أو ميزات ملوثة أو
				مدمرة أو برامج الكترونية ضاره قد تؤثر على جهاز الكمبيوتر الخاص بك نتيجة
				لاستخدامك أو وصولك أو انقطاعك أو عدم قدرتك على استخدام أو الوصول إلى
				موقع الويب و / أو أي مواقع خارجية. أنت تتنازل بموجبه عن أي وجميع الدعاوى
				المرفوعة ضدنا، أو ضد موظفينا ، أو المساهمين ، أو الشركات التابعة ، أو
				الأقسام ، أو الشركات التابعة ، أو الممثلين ، أو الوكلاء ، أو المرخصين ،
				الناشئة عن استخدامك أو وصولك أو انقطاعك أو عدم قدرتك على استخدام الموقع
				أو الوصول إليه.
			</TypographyStyle>
		</ul>
	);
};

export default ContentArabic;
